  
  Функция СведенияОВнешнейОбработке() Экспорт
	
	ПараметрыРегистрации 					= ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке("2.2.2.1");
	ПараметрыРегистрации.Вид 				= ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	ПараметрыРегистрации.БезопасныйРежим 	= Ложь;
	
	//Обмен Битрикс24 <-> 1С: Управление задачами
	НоваяКоманда 				= ПараметрыРегистрации.Команды.Добавить();
	НоваяКоманда.Представление 	= "СинхронизацияБитрикс24";
	НоваяКоманда.Идентификатор 	= НоваяКоманда.Представление;
	НоваяКоманда.Использование 	= ДополнительныеОтчетыИОбработкиКлиентСервер.ТипКомандыВызовСерверногоМетода();
	
	Возврат ПараметрыРегистрации;
	
КонецФункции

Функция ВыполнитьКоманду(ИдентификаторКоманды, ПараметрыКоманды) Экспорт
	
	РасширениеАктивно 	= Ложь;
	МассивРасширений 	= РасширенияКонфигурации.Получить(Новый Структура("Имя", "ИнтеграцияБитрикс24"));
	
	Если МассивРасширений.Количество() > 0 Тогда
		
		Расширение 			= МассивРасширений[0];
		РасширениеАктивно 	= Расширение.Активно;
		
	КонецЕсли;
	
	Если Не РасширениеАктивно Тогда
		ЗаписьЖурналаРегистрации("ВнешняяОбработка.ИнтеграцияБитрикс24.ВыполнитьКоманду", УровеньЖурналаРегистрации.Ошибка,,, "Выполнение команд не возможно. Расширение ""ИнтеграцияБитрикс24"" не активно");
	Иначе
		Если ИдентификаторКоманды = "СинхронизацияБитрикс24" Тогда
			ЗаписьЖурналаРегистрации("ВнешняяОбработка.ИнтеграцияБитрикс24.СинхронизацияБитрикс24", УровеньЖурналаРегистрации.Информация,,, "Начало выполнения регламентного задания ""СинхронизацияБитрикс24"" ");
			b24_РегламентныеЗадания.ВыполнитьОбмен();
			ЗаписьЖурналаРегистрации("ВнешняяОбработка.ИнтеграцияБитрикс24.СинхронизацияБитрикс24", УровеньЖурналаРегистрации.Информация,,, "Конец выполнения регламентного задания ""СинхронизацияБитрикс24"" ");
		КонецЕсли;
	КонецЕсли;
	
КонецФункции
