
Процедура Записать(Сайт, Объект) Экспорт 
	
	МенеджерЗаписи 			= РегистрыСведений.b24_ЗаблокированныеОбъектыДляЗагрузки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сайт 	= Сайт;
	МенеджерЗаписи.Объект 	= Объект;
	МенеджерЗаписи.Записать();
	
КонецПроцедуры     

Процедура Удалить(Сайт, Объект) Экспорт 
	
	МенеджерЗаписи 			= РегистрыСведений.b24_ЗаблокированныеОбъектыДляЗагрузки.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сайт 	= Сайт;
	МенеджерЗаписи.Объект 	= Объект;
	МенеджерЗаписи.Удалить();
	
КонецПроцедуры   

Процедура ИзменитьСайт(Сайт, Задача) Экспорт 
	
	ТекущийСайт 		= Справочники.b24_СайтИнтеграции.ПустаяСсылка();  
	ТекущийМассивСайтов = РегистрыСведений.b24_СостоянияОбменаЗадач.ПолучитьМассивСайтовЗадачи(Задача);  
	
	Если ТекущийМассивСайтов.Количество() > 0 Тогда 
		ТекущийСайт 		= ТекущийМассивСайтов[0];
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ТекущийСайт) Тогда 
		
		МенеджерЗаписи 			= РегистрыСведений.b24_ЗаблокированныеОбъектыДляЗагрузки.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Сайт 	= ТекущийСайт;
		МенеджерЗаписи.Объект 	= Задача;  
		МенеджерЗаписи.Прочитать();
		
		Если МенеджерЗаписи.Выбран() Тогда 
			РегистрыСведений.b24_ЗаблокированныеОбъектыДляЗагрузки.Удалить(ТекущийСайт, Задача); 
			РегистрыСведений.b24_ЗаблокированныеОбъектыДляЗагрузки.Записать(Сайт, Задача);  
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

Процедура Очистить(Сайт) Экспорт 
	
	НаборЗаписей = РегистрыСведений.b24_ЗаблокированныеОбъектыДляЗагрузки.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Сайт.Установить(Сайт); 
	НаборЗаписей.Записать();	
	
КонецПроцедуры