
Функция ПолучитьСайтПоНастройкеПодразделения(Подразделение) Экспорт 

	Сайт 			= Справочники.b24_СайтИнтеграции.ПустаяСсылка();
	МассивСайтов 	= Справочники.b24_СайтИнтеграции.ПолучитьВсе();
	ВсеНастройки 	= РегистрыСведений.b24_НастройкиИнтеграций.ПолучитьНастройкиПоМассивуСайтов(МассивСайтов); 
	
	Для Каждого ТекущийСайт Из МассивСайтов Цикл 
		
		Если Не ЗначениеЗаполнено(Сайт) Тогда 
			
			Настройки = ВсеНастройки[ТекущийСайт];  
			
			Если Настройки.Подразделение = Подразделение Тогда 
				Сайт = ТекущийСайт;	
			КонецЕсли;		
		КонецЕсли;		
	КонецЦикла;
	
	Возврат Сайт
	
КонецФункции