
&НаКлиенте
Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	
	Сайт = ПолучитьСайтПоЗадаче(ПараметрКоманды); 
	
	Если ЗначениеЗаполнено(Сайт) Тогда 
		ОбработкаКомандыНаСервере(ПараметрКоманды, Сайт); 
	Иначе
		
		Отбор = Новый Структура();
		Отбор.Вставить("Активно", Истина);
		
		ПараметрыОткрытия = Новый Структура();
		ПараметрыОткрытия.Вставить("Отбор", Отбор); 
		
		Оповещение = Новый ОписаниеОповещения("ОбработкаКомандыЗавершение", ЭтотОбъект, ПараметрКоманды);
		
		ОткрытьФорму("Справочник.b24_СайтИнтеграции.ФормаВыбора", ПараметрыОткрытия,,,,, Оповещение, РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаКомандыЗавершение(Результат, ДополнительныеПараметры) Экспорт

	Если Результат <> Неопределено Тогда 
		ОбработкаКомандыНаСервере(ДополнительныеПараметры, Результат);	
	КонецЕсли;	

КонецПроцедуры  

&НаСервере
Процедура ОбработкаКомандыНаСервере(Задача, Сайт)
	
	ДополнительныеСвойства = Новый Структура();
	ДополнительныеСвойства.Вставить("ТребуетВыгрузкиВБитрикс24", Сайт);
	
	b24_Интеграция.ЗаписатьОбъектВВыгружаемыеОбъекты(Задача, Ложь, ДополнительныеСвойства);
	
КонецПроцедуры    

&НаСервере
Функция ПолучитьСайтПоЗадаче(Задача)
	
	Подразделение 	= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Задача, "b24_ПодразделениеИсполнитель");
	Сайт			= Справочники.b24_Подразделения.ПолучитьСайтПоНастройкеПодразделения(Подразделение); 
	
	//Если Не ЗначениеЗаполнено(Сайт) Тогда 
	//	
	//	МассивСайтов = Справочники.b24_СайтИнтеграции.ПолучитьАктивные();
	//	
	//	Если МассивСайтов.Количество() = 1 Тогда 
	//		Сайт = МассивСайтов[0];
	//	КонецЕсли;
	//КонецЕсли;

	Возврат Сайт
	
КонецФункции

