 
#Область Модуль_Задачи 

#Область tasks_task_getFields
 
Функция Задачи_ВсеДоступныеПоля(Адрес) Экспорт 
	
	ПараметрыПреобразованияJSON 								= b24_КоннекторHTTP.ПолучитьПараметрыПреобразованияJSONПоУмолчанию();
	ПараметрыПреобразованияJSON.ИменаСвойствСоЗначениямиДата 	= b24_API.ПолучитьМассивСвойствСоЗначениямиДатаПоУмолчанию();
	
	Возврат b24_КоннекторHTTP.КакJson(b24_КоннекторHTTP.Get(Адрес), ПараметрыПреобразованияJSON)
	
КонецФункции 

#КонецОбласти 

#Область task_item_userfield_getlist

Функция Задачи_ПользовательскиеПоля(Адрес) Экспорт 
	
	ПараметрыПреобразованияJSON 								= b24_КоннекторHTTP.ПолучитьПараметрыПреобразованияJSONПоУмолчанию();
	ПараметрыПреобразованияJSON.ИменаСвойствСоЗначениямиДата 	= b24_API.ПолучитьМассивСвойствСоЗначениямиДатаПоУмолчанию();
	
	Возврат b24_КоннекторHTTP.КакJson(b24_КоннекторHTTP.Get(Адрес), ПараметрыПреобразованияJSON)
	
КонецФункции 

#КонецОбласти 

#Область task_item_userfield_get

Функция Задачи_ПользовательскоеПоле(Адрес, СтруктураПараметры) Экспорт 
	
	ПараметрыПреобразованияJSON 								= b24_КоннекторHTTP.ПолучитьПараметрыПреобразованияJSONПоУмолчанию();
	ПараметрыПреобразованияJSON.ИменаСвойствСоЗначениямиДата 	= b24_API.ПолучитьМассивСвойствСоЗначениямиДатаПоУмолчанию();
	
	Возврат b24_КоннекторHTTP.КакJson(b24_КоннекторHTTP.Get(Адрес, СтруктураПараметры), ПараметрыПреобразованияJSON)
	
КонецФункции 

#КонецОбласти

#КонецОбласти
