
Процедура ПриЗаписи(Отказ)
	
	Если Не Отказ Тогда 
		
		//синхронизация справочника Подразделений
		Если ЕстьПодразделенияВОсновнойКонфигурации() Тогда 
			СинхронизироватьСправочникПодразделений();	
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры  

Функция ЕстьПодразделенияВОсновнойКонфигурации()
	
	Результат = Ложь;
	
	Попытка
		
		Идентификатор = ОбщегоНазначения.ИдентификаторОбъектаМетаданных("Справочник.шт_Подразделения");
		
		Если Идентификатор <> Неопределено Тогда 
			Результат = Истина;	
		КонецЕсли;
		
	Исключение
	КонецПопытки;
	
	Возврат Результат
	
КонецФункции

Процедура СинхронизироватьСправочникПодразделений()
		
	ЗагрузитьРодителяРекурсивно(Родитель);
	
	ПодразделениеСсылка = Справочники.шт_Подразделения.НайтиПоРеквизиту("ID", ID); 
	РодительСсылка 		= Справочники.шт_Подразделения.ПустаяСсылка();  

	Если ЗначениеЗаполнено(Родитель) Тогда 
		РодительСсылка = Справочники.шт_Подразделения.НайтиПоРеквизиту("ID", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Родитель, "ID"));	
	КонецЕсли;	
	
	Если ПодразделениеСсылка.Пустая() Тогда 
		ОбъектПодразделение = Справочники.шт_Подразделения.СоздатьЭлемент();
	Иначе 
		ОбъектПодразделение = ПодразделениеСсылка.ПолучитьОбъект();	
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ОбъектПодразделение, ЭтотОбъект, "Наименование, Руководитель, ID"); 
	ОбъектПодразделение.Родитель = РодительСсылка;
	ОбъектПодразделение.Записать();  
	
КонецПроцедуры  

Процедура ЗагрузитьРодителяРекурсивно(Родитель)
	
	Если ЗначениеЗаполнено(Родитель) Тогда 
		
		ДанныеСсылки = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Родитель, "Наименование, Родитель, Руководитель, ID");
		
		Если ЗначениеЗаполнено(ДанныеСсылки.Родитель) Тогда 
			ЗагрузитьРодителяРекурсивно(ДанныеСсылки.Родитель);
		КонецЕсли;                                             
		
		ПодразделениеСсылка = Справочники.шт_Подразделения.НайтиПоРеквизиту("ID", ДанныеСсылки.ID); 
		РодительСсылка 		= Справочники.шт_Подразделения.ПустаяСсылка();   
		
		Если ЗначениеЗаполнено(ДанныеСсылки.Родитель) Тогда 
			РодительСсылка = Справочники.шт_Подразделения.НайтиПоРеквизиту("ID", ОбщегоНазначения.ЗначениеРеквизитаОбъекта(ДанныеСсылки.Родитель, "ID"));	
		КонецЕсли;	
		
		Если ПодразделениеСсылка.Пустая() Тогда 
			ОбъектПодразделение = Справочники.шт_Подразделения.СоздатьЭлемент();
		Иначе 
			ОбъектПодразделение = ПодразделениеСсылка.ПолучитьОбъект();	
		КонецЕсли;
		
		ЗаполнитьЗначенияСвойств(ОбъектПодразделение, ДанныеСсылки);  
		ОбъектПодразделение.Родитель = РодительСсылка;		
		ОбъектПодразделение.Записать();
		
	КонецЕсли;	
	
КонецПроцедуры