
&НаКлиенте
Процедура Обновить(Команда)
	ЗадачаПриИзмененииНаСервере();
КонецПроцедуры 

&НаКлиенте
Процедура ОбновитьСПортала(Команда)
	ОбновитьСПорталаНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбновитьСПорталаНаСервере()
	
	ДанныеСсылки		= ОбщегоНазначения.ЗначенияРеквизитовОбъекта(Объект.Задача, "НомерВнешнейЗаявки, Исполнитель, СрокИсполнения, Статус");
	TASKID				= ДанныеСсылки.НомерВнешнейЗаявки;
	TASKID				= Формат(TASKID, "ЧГ=0"); 
	
	МассивСайтов		= РегистрыСведений.b24_СостоянияОбменаЗадач.ПолучитьМассивСайтовЗадачи(Объект.Задача); 
	Настройки			= РегистрыСведений.b24_НастройкиИнтеграций.ПолучитьНастройкиПоМассивуСайтов(МассивСайтов);
	НастройкиСайта		= Настройки[МассивСайтов[0]];
	
	ДанныеБитрикса 		= b24_API.Задачи_ПолучитьЗадачу(TASKID, НастройкиСайта.ПараметрыПодключения); 
	
	Данные 					= Обработки.b24_ПрееобразованиеBBКодов.ДанныеПреобразованияBBКодаВФорматированныйДокумент(ДанныеБитрикса.description);
	ФорматированныйДокумент = Данные.ФорматированныйДокумент;
	
	ТекстовыйДокумент.УстановитьТекст(ДанныеБитрикса.description); 
	ТекстовыйДокументHTML.УстановитьТекст(Данные.ТекстHTML); 
	
КонецПроцедуры

&НаСервере
Процедура ЗадачаПриИзмененииНаСервере()
	
	ТекстСодержания 		= ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Задача, "ТекстСодержания");
	Данные 					= Обработки.b24_ПрееобразованиеBBКодов.ДанныеПреобразованияBBКодаВФорматированныйДокумент(ТекстСодержания);
	ФорматированныйДокумент = Данные.ФорматированныйДокумент;
	
	ТекстовыйДокумент.УстановитьТекст(ТекстСодержания); 
	ТекстовыйДокументHTML.УстановитьТекст(Данные.ТекстHTML); 
	
КонецПроцедуры  