
Процедура ОбработкаПроверкиЗаполнения(Отказ, ПроверяемыеРеквизиты)
	
	//проверим что фильтры не задублированы
	ТаблицаФильтрыЗадачи = Фильтры_Задачи.Выгрузить();
	ТаблицаФильтрыЗадачи.Колонки.Добавить("Количество");
	ТаблицаФильтрыЗадачи.ЗаполнитьЗначения(1, "Количество");
	ТаблицаФильтрыЗадачи.Свернуть("Ключ", "Количество");
	
	Для Каждого Строка Из ТаблицаФильтрыЗадачи Цикл 
		Если Строка.Количество > 1 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Найдено дублирующее значение - %1", Строка.Ключ),,, Отказ);
		КонецЕсли;
	КонецЦикла;	
	
	ТаблицаФильтрыПользователи = Фильтры_Пользователи.Выгрузить();
	ТаблицаФильтрыПользователи.Колонки.Добавить("Количество");
	ТаблицаФильтрыПользователи.ЗаполнитьЗначения(1, "Количество");
	ТаблицаФильтрыПользователи.Свернуть("Ключ", "Количество");
	
	Для Каждого Строка Из ТаблицаФильтрыПользователи Цикл 
		Если Строка.Количество > 1 Тогда 
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(СтрШаблон("Найдено дублирующее значение - %1", Строка.Ключ),,, Отказ);
		КонецЕсли;
	КонецЦикла;	
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ)
	
	Если ПометкаУдаления Тогда 
		Активно = Ложь;
	КонецЕсли;
	
КонецПроцедуры
