
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("Сайт")
		И ЗначениеЗаполнено(Параметры.Сайт) Тогда 
		
		ПараметрыПодключения 	= Справочники.b24_СайтИнтеграции.ПолучитьПараметрыПодключения(Параметры.Сайт);
		Данные 					= b24_API.Задачи_ПользовательскиеПоля(ПараметрыПодключения);
		
		Если Данные <> Неопределено Тогда 
			Для Каждого Строка Из Данные.result Цикл 
				
				НоваяСтрока = Таблица.Добавить();
				ЗаполнитьЗначенияСвойств(НоваяСтрока, Строка);
				
				НоваяСтрока.TYPE 	= Строка.USER_TYPE_ID;
				НоваяСтрока.FIELD 	= Строка.FIELD_NAME;
				
			КонецЦикла;
			
		КонецЕсли;
	КонецЕсли;
	
	Если Параметры.Свойство("Идентификатор")
		И ЗначениеЗаполнено(Параметры.Идентификатор)
		И Таблица.Количество() > 0 Тогда 
		
		ИскомыеСтроки = Таблица.НайтиСтроки(Новый Структура("FIELD", Параметры.Идентификатор));
		
		Если ИскомыеСтроки.Количество() > 0 Тогда 
			Элементы.Таблица.ТекущаяСтрока = ИскомыеСтроки[0].ПолучитьИдентификатор();
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ТаблицаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	ТекущиеДанные = Элементы.Таблица.ТекущиеДанные;
	
	Если ТекущиеДанные <> Неопределено Тогда 
		
		Структура = Новый Структура("FIELD, TYPE"); 
		ЗаполнитьЗначенияСвойств(Структура, ТекущиеДанные); 
		Закрыть(Структура);
		
	КонецЕсли;
	
КонецПроцедуры
