
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Параметры.Свойство("Задача", Задача);
	
	Если Не ЗначениеЗаполнено(Задача) Тогда 
		ВызватьИсключение "Не заполнен обязательный параметр ""Задача""";
	Иначе 
		Список.Параметры.УстановитьЗначениеПараметра("Задача", Задача);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура СписокВыборЗначения(Элемент, Значение, СтандартнаяОбработка)
	
	Результат		= Ложь;
	ТекущиеДанные 	= Элементы.Список.ТекущиеДанные; 
	
	Если ТекущиеДанные <> Неопределено Тогда 
		Результат = ПередатьЗадачуНаСервереБезКонтекста(Задача, ТекущиеДанные.Сайт);		
	КонецЕсли;
	
	Если Результат Тогда 
   		Оповестить("b24_ОбновитьФорму", Задача);  
		Закрыть();
	КонецЕсли;
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПередатьЗадачуНаСервереБезКонтекста(Задача, Сайт)
	Возврат b24_Интеграция.ПередатьЗадачу(Задача, Сайт);
КонецФункции
