
&После("ДобавитьРеквизитыНаФорму_УчетныеЗаписиЭлектроннойПочты")
Процедура b24_ДобавитьРеквизитыНаФорму_УчетныеЗаписиЭлектроннойПочты(Форма, ТекущийОбъект)
	
	пЭлементыФормы 				= Форма.Элементы;  
	
	ГруппаНаФорме 				= ДобавитьГруппуНаФорму("b24_Битрикс24",пЭлементыФормы, пЭлементыФормы.Шапка);
	ГруппаНаФорме.Группировка 	= ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;    
	ГруппаНаФорме.Заголовок		= "Битрикс24";
	
	ДобавитьРеквизитНаФорму_ПолеФлажка("b24_ОтправлятьВБитрикс24", пЭлементыФормы, ГруппаНаФорме);  
	ДобавитьРеквизитНаФорму_ПолеВвода("b24_Подразделение", пЭлементыФормы, ГруппаНаФорме);  
	
КонецПроцедуры
